app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2014-10-24 19:36:17.049049"], ["updated_at", "2014-10-24 19:36:17.049049"]]
---
  def create
   @user = User.new(user_params)
   if @user.save